#include <linux/i2c.h>
#include <linux/platform_device.h>
#include <linux/delay.h>
#include <linux/cdev.h>
#include <linux/uaccess.h>
#include <linux/slab.h>
#include <linux/fs.h>
#include <linux/dma-mapping.h>
#include "cam_cal.h"
#include "cam_cal_define.h"
#include "kd_camera_hw.h"
#include "kd_imgsensor.h"
#include "kd_imgsensor_define.h"
#include "kd_imgsensor_errcode.h"

#include "hi842_otp.h"
#include <linux/dma-mapping.h>
#ifdef CONFIG_COMPAT
/* 64 bit */
#include <linux/fs.h>
#include <linux/compat.h>
#endif

#define PFX "HI842_OTP_FMT"

#ifdef Hynix_OTP_File_Load
  #include <linux/kernel.h>
  #include <linux/init.h> 
  #include <linux/module.h> 
  #include <linux/syscalls.h> 
  #include <linux/fcntl.h> 
  #include <asm/uaccess.h> 
  #include <linux/types.h> 
  #include <linux/slab.h> 
#endif 

//#define CAM_CALGETDLT_DEBUG
#define CAM_CAL_DEBUG
#ifdef CAM_CAL_DEBUG
  #define CAM_CALINF(fmt, arg...)    pr_debug("[%s] " fmt, __FUNCTION__, ##arg)
  #define CAM_CALDB(fmt, arg...)     pr_debug("[%s] " fmt, __FUNCTION__, ##arg)
  #define CAM_CALERR(fmt, arg...)    pr_err("[%s] " fmt, __FUNCTION__, ##arg)
#else
  #define CAM_CALINF(x,...)
  #define CAM_CALDB(x,...)
  #define CAM_CALERR(fmt, arg...)    pr_err("[%s] " fmt, __FUNCTION__, ##arg)
#endif

static DEFINE_SPINLOCK(g_CAM_CALLock); // for SMP


#define USHORT             unsigned short
#define BYTE               unsigned char
#define Sleep(ms) mdelay(ms)


/*******************************************************************************
*
********************************************************************************/
#define CAM_CAL_ICS_REVISION 1 

/*******************************************************************************
*
********************************************************************************/
#define CAM_CAL_DRVNAME "CAM_CAL_DRV"
#define CAM_CAL_I2C_GROUP_ID 0

/*******************************************************************************
*
********************************************************************************/
#define OTP_READ_SKIP 0 
#define OTP_READ 1 

static dev_t g_CAM_CALdevno = MKDEV(CAM_CAL_DEV_MAJOR_NUMBER,0);
static struct cdev * g_pCAM_CAL_CharDrv = NULL;

static struct class *CAM_CAL_class = NULL;
static atomic_t g_CAM_CALatomic;


#define MAX_LSC_SIZE 2048
#define MAX_OTP_SIZE 2200
static int Hi842_otp_read = 0;

struct Hynix_OTP_Sensor_reg { // OTP Register Type
	u16 addr;
	u16 val;
};

int RG_ratio_unit = 0; 
int RG_ratio_golden = 0; 
int BG_ratio_unit = 0; 
int BG_ratio_golden = 0; 

u16 otp_af_data[2];

typedef struct {

#if 0
	u16	   ChipInfo; //chip id, lot Id, Chip No. Etc
	u8     IdGroupWrittenFlag; //"Bit[7:6]: Flag of WB_Group_0  00: empty  01: valid group 11 or 10: invalid group"
	u8     ModuleInfo; //MID, 0x02 for truly
	u8     Year;
	u8     Month;
	u8     Day;
	u8     LensInfo;
	u8     VcmInfo;
	u8     DriverIcInfo;
	u8     LightTemp;
#endif

    u8     flag;               // 0
	u32    CaliVer;            // 1~4
	u16    SerialNum;          // 5,6
	u8     Version;            // 7
	u8     AwbAfInfo;          // 8
	u8     UnitAwbR;           // 9
	u8     UnitAwbGr;          // 10
	u8     UnitAwbGb;          // 11
	u8     UnitAwbB;           // 012
	u8     GoldenAwbR;         // 13
	u8     GoldenAwbGr;        // 14
	u8     GoldenAwbGb;        // 15
	u8     GoldenAwbB;         // 16
	u16    AfInfinite;         // 17 18
	u16    AfMacro;            // 19 20
	u16    LscSize;            // 21 22 
	u8   Lsc[MAX_LSC_SIZE];    // 23
	u8     PixelID_forTinno;   // 20151203 ADD
}OTP_MTK_TYPE;

typedef union {
        u8 Data[MAX_OTP_SIZE]; // 2200 
        OTP_MTK_TYPE       MtkOtpData; 
} MTK_OTP_DATA;

typedef struct {
	u8     UnitAwbR;          // 0
	u8     UnitAwbGr;         // 1   
	u8     UnitAwbGb;         // 2 
	u8     UnitAwbB;          // 3
	u8     GoldenAwbR;        // 4
	u8     GoldenAwbGr;       // 5
	u8     GoldenAwbGb;       // 6
	u8     GoldenAwbB;        // 7
	u16    AfInfinite;        // 8,9
	u16    AfMacro;           // 10,11
    u8     R_Ratio;           // 12
    u8     B_Ratio;           // 13
    u8     Gr_Ratio;          // 14
    u8     Gb_Ratio;          // 15
	u8   Lsc[MAX_LSC_SIZE];   // 16
}OTP_QCT_TYPE;

typedef union {
        u8 Data[MAX_OTP_SIZE]; // MAX_OTP_SIZE is 2200ea 
        OTP_QCT_TYPE       QctOtpData; 
} QCT_OTP_DATA;

MTK_OTP_DATA hi842_otp_data = {{0}}; // Hynix Data Structure 
QCT_OTP_DATA hi842_tmp_data = {{0}}; // Hynix Data Structure 


extern kal_uint16 read_cmos_sensor_8(kal_uint16 addr);


extern void write_cmos_sensor_16(kal_uint16 addr, kal_uint16 para);
extern void write_cmos_sensor_8(kal_uint16 addr, kal_uint8 para);

static void Enable_Hi842_OTP_Read(void )
{
    write_cmos_sensor_16(0x0a00, 0x0000); 
    write_cmos_sensor_16(0x0e00, 0x0002); 
    write_cmos_sensor_16(0x0e02, 0x0002); 
    write_cmos_sensor_16(0x2000, 0x4031);
    write_cmos_sensor_16(0x2002, 0x83f0);
    write_cmos_sensor_16(0x2004, 0x40f2);
    write_cmos_sensor_16(0x2006, 0x000a);
    write_cmos_sensor_16(0x2008, 0x0f90);
    write_cmos_sensor_16(0x200a, 0x43c2);
    write_cmos_sensor_16(0x200c, 0x0f82);
